MariusLamm/IKEA_LED_1.0_STM32/Src/fsm.c

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"
#include "main.h"
#include "fsm.h"
#include "ledstringdriver.h"

/* Variables -----------------------------------------------------------------*/
/*char array to display time for RTC*/
char sTime[20];
char string[20];

/*enum for all states*/
enum states {
    S1,S2,S3,
}state;

/*Init State of the FSM*/
state = S1; // init status = S1


void stateMachine()
{
  if(state == S1){
    state1();
    state = S2;
  }

  else if(state == S2){
    state2();
    state = S3;
  }

  else if(state == S3){
    state3();
    state = S2;
  }

  else{
    state = S2;
  }
}


/* write RTC with Rotary Encoder */
void state1()
{
  PrintToUART("set hours for RTC:\n");
  PrintToUART("turn rotary encoder left/right\n");
  /*Wait for Conformation with Button 1*/
  while(getButton1Flag(); == 0){
    //display the current Hour
      Hours = getRotEncoderData();//TODO Implement rotary encoder
      sprintf(string,"Hour: %d\n",Hours);
      PrintToUART("press Button 1 to confirm:\n");
      PrintToUART(string);
  }

  PrintToUART("set minutes for RTC:\n");
  PrintToUART("turn rotary encoder left/right\n");
  /*Wait for Conformation with Button 1*/
  while(getButton1Flag(); == 0){
    //display the current Minute
    Minute = getRotEncoderData();//TODO Implement rotary encoder
    sprintf(string,"Minute: %d\n",Minute);
    PrintToUART("press Button 1 to confirm:\n");
    PrintToUART(string);
  }

  RTC_Set_Hours_Minutes_Seconds(Hours,Minutes,0);
  sprintf(string,"Time set to: %d:",Hours);
  sprintf(string,"%d\n",Minutes);
  PrintToUART(string);

  /*Reset Button 1 Flag */
  resetButton1Flag();
}

/*Get Data from Rotary Encoder
and set LED String with Value and Index*/
void state2()
{
  PrintToUART("set Index of LED String (0-9):\n");
  PrintToUART("turn rotary encoder left/right\n");

  /*Wait for Conformation with Button 1*/
  while(getButton1Flag(); == 0)){
    //display the current position of LED Index
    setLEDStringIndex(); // TODO
  }

  PrintToUART("set Value of LED String (0-4000):\n");
  PrintToUART("turn rotary encoder left/right\n");

  /*Wait for Conformation with Button 1*/
  while(getButton1Flag(); == 0)){
    //display the current position of LED Value
    setLEDStringValue(); // TODO
  }

  /*Reset Button 1 Flag */
  resetButton1Flag();
}

/*Display time on UART*/
void state3()
{
  /*Read RTC Minutes and Hours and display on UART*/
  RTC_CalendarShow(Time, Date);
  sprintf(sTime,"%02d:%02d:%02d\n",Time[0],Time[1],Time[2]);
  PrintToUART(sTime);
  HAL_Delay(5000);
}
